In [9]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [10]:
temp_db = create_engine('sqlite:///:memory:')

In [11]:
temp_db

Engine(sqlite:///:memory:)

In [16]:
df = pd.DataFrame(data=np.random.randint(low=0,high=100,size=(4,4)),columns=['a','b','c','d'])

In [17]:
df

    a   b   c   d
0  27  18  40  97
1  60  14  69  72
2  15  11  33  81
3   0  49  95  80

In [23]:
data = pd.read_sql('new_table',con=temp_db)

In [24]:
data

   index   a   b   c   d
0      0  27  18  40  97
1      1  60  14  69  72
2      2  15  11  33  81
3      3   0  49  95  80

In [28]:
pd.read_sql_query(sql="SELECT a,c FROM new_table",con=temp_db)

    a   c
0  27  40
1  60  69
2  15  33
3   0  95